HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-mw-core/lwip-whd-port/cy_lwip.c
/*
 * Copyright 2021, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
*/

#include <string.h>
#include <stdint.h>
#include "lwipopts.h"
#include "lwip/netif.h"
#include "lwip/netifapi.h"
#include "lwip/init.h"
#include "lwip/dhcp.h"
#include "lwip/etharp.h"
#include "lwip/tcpip.h"
#include "lwip/ethip6.h"
#include "lwip/igmp.h"
#include "lwip/nd6.h"
#include "netif/ethernet.h"
#include "lwip/prot/autoip.h"
#include "lwip/prot/dhcp.h"
#include "lwip/dns.h"

#include "cybsp_wifi.h"
#include "cy_network_buffer.h"
#include "whd.h"
#include "cy_lwip.h"
#include "cy_lwip_error.h"
#include "cy_lwip_dhcp_server.h"
#include "cy_result.h"
#include "whd.h"
#include "whd_wifi_api.h"
#include "whd_network_types.h"
#include "whd_buffer_api.h"
#include "cy_lwip_log.h"
#include "cy_wifimwcore_eapol.h"

/* While using lwip/sockets errno is required. Since IAR and ARMC6 doesn't define errno variable, the below definition is required for building it successfully. */
#if !( (defined(__GNUC__) && !defined(__ARMCC_VERSION)) )
int errno;
#endif

#define EAPOL_PACKET_TYPE                        0x888E

#define MULTICAST_IP_TO_MAC(ip)                  {   (uint8_t) 0x01,             \
                                                     (uint8_t) 0x00,             \
                                                     (uint8_t) 0x5e,             \
                                                     (uint8_t) ((ip)[1] & 0x7F), \
                                                     (uint8_t) (ip)[2],          \
                                                     (uint8_t) (ip)[3]           \
                                                 }

#define IPV6_MULTICAST_TO_MAC_PREFIX             (0x33)

#define DHCP_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS (15000)
#ifndef AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS
#define AUTO_IP_ADDRESS_RESOLUTION_TIMEOUT_IN_MS (60000 * 10)
#endif
#define DCHP_RENEWAL_DELAY_IN_MS                 (100)
#define DHCP_STOP_DELAY_IN_MS                    (400)

#define MAX_NW_INTERFACE                         (2)

struct  netif                                    *cy_lwip_ip_handle[MAX_NW_INTERFACE];
#define IP_HANDLE(interface)                     (cy_lwip_ip_handle[(interface) & 3])

#define MAX_AUTO_IP_RETRIES                      (5)

/******************************************************
 *               Variable Definitions
 ******************************************************/
static cy_network_activity_event_callback_t activity_callback = NULL;
static bool is_dhcp_client_required = false;
static cy_wifimwcore_eapol_packet_handler_t internal_eapol_packet_handler = NULL;
static cy_lwip_ip_change_callback_t ip_change_callback = NULL;

#if LWIP_IPV4
static cy_lwip_dhcp_server_t internal_dhcp_server;
#endif

static struct netif       sta_ip_handle;
static struct netif       ap_ip_handle;

struct netif* cy_lwip_ip_handle[MAX_NW_INTERFACE] =
{
    [CY_LWIP_STA_NW_INTERFACE] =  &sta_ip_handle,
    [CY_LWIP_AP_NW_INTERFACE]  =  &ap_ip_handle
};

/* Interface init status */
bool ip_networking_inited[MAX_NW_INTERFACE];
#define SET_IP_NETWORK_INITED(interface, status)   (ip_networking_inited[(interface)&3] = status)

/* IP UP status */
bool ip_up[MAX_NW_INTERFACE];
#define SET_IP_UP(interface, status)               (ip_up[(interface)&3] = status)

/******************************************************
 *               Static Function Declarations
 ******************************************************/
static void internal_ip_change_callback (struct netif *netif);
#if LWIP_IPV4
static void invalidate_all_arp_entries(struct netif *netif);
#endif
static bool is_interface_added(cy_lwip_nw_interface_role_t role);
static cy_rslt_t is_interface_valid(cy_lwip_nw_interface_t *iface);
static bool is_network_up(cy_lwip_nw_interface_role_t role);
/******************************************************
 *               Function Definitions
 ******************************************************/
/*
 * This function takes packets from the radio driver and passes them into the
 * LwIP stack.  If the stack is not initialized, or if the LwIP stack does not
 * accept the packet, the packet is freed (dropped). If packet is of type EAPOL
 * and if EAPOL handler is registered, packet will be redirected to registered
 * handler and should be freed by EAPOL handler.
 */
void cy_network_process_ethernet_data(whd_interface_t iface, whd_buffer_t buf)
{
    uint8_t *data = whd_buffer_get_current_piece_data_pointer(iface->whd_driver, buf);
    uint16_t ethertype;
    struct netif *net_interface = NULL;

    if(iface->role == WHD_STA_ROLE)
    {
        net_interface = &sta_ip_handle;
    }
    else if(iface->role == WHD_AP_ROLE)
    {
        net_interface = &ap_ip_handle;
    }
    else
    {
        cy_buffer_release(buf, WHD_NETWORK_RX) ;
        return;
    }

