HHyeon/stm32-connectivity/Projects/STM32H747I-DISCO/Applications/wifi_scan/Middlewares/Third_Party/Infineon_Wireless_Connectivity/wifi-mw-core/lwip-whd-port/cy_lwip.c
/*
 * This functions helps to register/unregister callback for network activity
 */
void cy_network_activity_register_cb(cy_network_activity_event_callback_t cb)
{
    /* update the activity callback with the argument passed */
    activity_callback = cb;
}

/*
 * This function notifies network activity to LPA module.
 */
cy_rslt_t cy_network_activity_notify(cy_network_activity_type_t activity_type)
{
    if(activity_callback)
    {
        if(activity_type == CY_NETWORK_ACTIVITY_TX)
        {
            activity_callback(true);
        }
        else if(activity_type == CY_NETWORK_ACTIVITY_RX)
        {
            activity_callback(false);
        }
        else
        {
            wm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Invalid network activity type\n");
            return CY_RSLT_LWIP_BAD_ARG;
        }
    }

    return CY_RSLT_SUCCESS;
}
#if LWIP_IPV4
cy_rslt_t cy_lwip_dhcp_renew(cy_lwip_nw_interface_t *iface)
{
    if(is_interface_valid(iface) != CY_RSLT_SUCCESS)
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }
    /* Invalidate ARP entries */
    netifapi_netif_common(IP_HANDLE(iface->role), (netifapi_void_fn) invalidate_all_arp_entries, NULL );

    /* DHCP renewal*/
    netifapi_netif_common(IP_HANDLE(iface->role), (netifapi_void_fn)dhcp_renew, NULL);

    cy_rtos_delay_milliseconds(DCHP_RENEWAL_DELAY_IN_MS);
    return CY_RSLT_SUCCESS;
}

/**
 * Remove all ARP table entries of the specified netif.
 * @param netif points to a network interface
 */
static void invalidate_all_arp_entries(struct netif *netif)
{
     /*free all the entries in arp list */
    etharp_cleanup_netif(netif);
}
#endif

/* Used to register callback for EAPOL packets */
cy_rslt_t cy_wifimwcore_eapol_register_receive_handler( cy_wifimwcore_eapol_packet_handler_t eapol_packet_handler )
{
    internal_eapol_packet_handler = eapol_packet_handler;
    return CY_RSLT_SUCCESS;
}

static void internal_ip_change_callback (struct netif *netif)
{
    /* notify wcm about ip change */
    if(ip_change_callback != NULL)
    {
        ip_change_callback(NULL);
    }
}

static bool is_interface_added(cy_lwip_nw_interface_role_t role)
{
    return (ip_networking_inited[((uint8_t)role)&3]);
}

static bool is_network_up(cy_lwip_nw_interface_role_t role)
{
    return (ip_up[((uint8_t)role)&3]);
}

static cy_rslt_t is_interface_valid(cy_lwip_nw_interface_t *iface)
{
    if((iface == NULL) || ((iface->role != CY_LWIP_AP_NW_INTERFACE) && (iface->role != CY_LWIP_STA_NW_INTERFACE)))
    {
        return CY_RSLT_LWIP_BAD_ARG;
    }

    return CY_RSLT_SUCCESS;
}
